-- ============================================================
-- 2.6.1.2 本月收到数分组存货编码名称映射汇总表
-- ============================================================
SELECT t.分组客户名称, t.存货编码, t.单据年月,
    存货名称 = STUFF((SELECT DISTINCT '、'+ISNULL(i2.存货名称,'') FROM 寄售点数据指标表0630 i2
        WHERE i2.分组客户名称=t.分组客户名称 AND i2.存货编码=t.存货编码 AND i2.单据年月=t.单据年月 FOR XML PATH('')),1,1,''),
    SUM(ISNULL(t.调拨数量,0)) AS 调拨单存货编码合计
INTO 本月收到数分组存货编码名称映射汇总表0630
FROM 寄售点数据指标表0630 t
WHERE 单据年月 = '2026-6'
GROUP BY t.分组客户名称, t.存货编码, t.单据年月;
